# 1. fill null values of a  data frame using median and mode

In [2]:
import numpy as np
import pandas as pd

In [12]:
a = { 'G1': [1, 2,3,4],
                'G2': [np.NaN, np.NaN, np.NaN, 27],
                'G3': [45,87,54,63],
                'G4': [45,45,69,21]}
b = pd.DataFrame(a)
mode = b['G2'].mean()
b['G2'].fillna(value=mode, inplace=True)
print('Updated Dataframe:')
print(b) #replacing mean

Updated Dataframe:
   G1    G2  G3  G4
0   1  27.0  45  45
1   2  27.0  87  45
2   3  27.0  54  69
3   4  27.0  63  21

In [22]:
a = { 'G1': [1, 2,3,4],
                'G2': [44, np.NaN, np.NaN, 27],
                'G3': [45,87,54,63],
                'G4': [45,45,69,21]}
c = pd.DataFrame(a)
median = c['G2'].median()
c['G2'].fillna(value=median, inplace=True)
print(c)

   G1    G2  G3  G4
0   1  44.0  45  45
1   2  35.5  87  45
2   3  35.5  54  69
3   4  27.0  63  21

# 2. what is the difference between merging and joining in dataframe

In [24]:
# join and merge can be used to combines two dataframes but the join method combines two dataframes 
# on the basis of their indexes.
# merge method allows us to specify columns beside the index to join on for both dataframes.

# 3.create a data frame and add a column. add names in it and use apply function to return names whose length is greater than 5

In [36]:
d = {'name':['ram','diya','Tom','Krish','Jack'], 'age':[23,32,43,21,56]}
e = pd.DataFrame(d)
city = ['hyderabad','chennai','bangalore','kerla','delhi']
e['city'] = city
e

    name  age       city
0    ram   23  hyderabad
1   diya   32    chennai
2    Tom   43  bangalore
3  Krish   21      kerla
4   Jack   56      delhi

# 4. create a numpy array and a dataframe and concatenate them

In [59]:
arr = np.array((1, 2, 3, 4, 5))
df = pd.DataFrame([6, 7, 8, 9, 10], columns=list('A'))
df = pd.concat([df, pd.DataFrame(arr, columns = ['B'])], axis=1)
df

    A  B
0   6  1
1   7  2
2   8  3
3   9  4
4  10  5